rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
  status = HAL_I2C_Mem_Read(&hi2c1, DS3231_I2C_ADDRESS_HAL, 0x00U,
                            I2C_MEMADD_SIZE_8BIT, raw_registers,
                            sizeof(raw_registers), 100U);
  if (status != HAL_OK)
  {
    return false;
  }

  printed = snprintf(buffer, buffer_length,
                     "%04u-%02u-%02u %02u:%02u:%02u",
                     (unsigned int) (2000U + DS3231_BcdToBin(raw_registers[6])),
                     (unsigned int) DS3231_BcdToBin((uint8_t) (raw_registers[5] & 0x1FU)),
                     (unsigned int) DS3231_BcdToBin(raw_registers[4]),
                     (unsigned int) DS3231_DecodeHour(raw_registers[2]),
                     (unsigned int) DS3231_BcdToBin(raw_registers[1]),
                     (unsigned int) DS3231_BcdToBin((uint8_t) (raw_registers[0] & 0x7FU)));
  return (printed > 0) && ((size_t) printed < buffer_length);
}

/**
  * @brief Try to read the DS3231 clock registers a few times before giving up.
  * @param buffer Output buffer for the human-readable time string.
  * @param buffer_length Size of the output buffer.
  * @retval true when the RTC replied with a valid timestamp.
  */
static bool DS3231_ReadDateTimeWithRetry(char *buffer, size_t buffer_length)
{
  for (uint32_t attempt = 0U; attempt < DS3231_READ_RETRY_ATTEMPTS; ++attempt)
  {
    if (DS3231_ReadDateTime(buffer, buffer_length))
    {
      return true;
    }

    if ((attempt + 1U) < DS3231_READ_RETRY_ATTEMPTS)
    {
      HAL_Delay(DS3231_READ_RETRY_DELAY_MS);
    }
  }

  return false;
}

#if DS3231_ENABLE_BUILD_TIME_SEED
/**
 * @brief Write the firmware build timestamp to the DS3231 registers.
 *
 * Enabled only when we intentionally want to refresh a blank RTC from the
 * compile-time clock.
 */
static void DS3231_SetBuildTime(void)
{
  /* Parse __DATE__: "Mmm DD YYYY" */
  static const char * const months = "JanFebMarAprMayJunJulAugSepOctNovDec";
  char mon_str[4] = { __DATE__[0], __DATE__[1], __DATE__[2], '\0' };
  uint8_t month = 1U;
  for (uint8_t m = 0U; m < 12U; m++)
  {
    if (strncmp(mon_str, &months[m * 3U], 3U) == 0)
    {
      month = (uint8_t)(m + 1U);
      break;
    }
  }
  /* Day: __DATE__[4..5], space-padded for single digits */
  uint8_t day  = (uint8_t)((__DATE__[4] == ' ' ? 0U : (uint8_t)(__DATE__[4] - '0')) * 10U
                            + (uint8_t)(__DATE__[5] - '0'));
  uint8_t year = (uint8_t)(((uint8_t)(__DATE__[9]  - '0')) * 10U
                            + (uint8_t)(__DATE__[10] - '0')); /* last 2 digits of year */

  /* Parse __TIME__: "HH:MM:SS" */
  uint8_t hour = (uint8_t)(((uint8_t)(__TIME__[0] - '0')) * 10U + (uint8_t)(__TIME__[1] - '0'));
  uint8_t min  = (uint8_t)(((uint8_t)(__TIME__[3] - '0')) * 10U + (uint8_t)(__TIME__[4] - '0'));
  uint8_t sec  = (uint8_t)(((uint8_t)(__TIME__[6] - '0')) * 10U + (uint8_t)(__TIME__[7] - '0'));

  /* DS3231 registers 0x00-0x06: sec, min, hour, dow, date, month, year (all BCD) */
#define TO_BCD(v)  ((uint8_t)((((v) / 10U) << 4U) | ((v) % 10U)))
  uint8_t regs[8] = {
    0x00U,        /* register address */
    TO_BCD(sec),
    TO_BCD(min),
    TO_BCD(hour),
    0x01U,        /* day-of-week: not tracked, set to 1 */
    TO_BCD(day),
    TO_BCD(month),
    TO_BCD(year),
  };
#undef TO_BCD

  HAL_StatusTypeDef status = HAL_I2C_Master_Transmit(
      &hi2c1, DS3231_I2C_ADDRESS_HAL, regs, sizeof(regs), 100U);
  if (status == HAL_OK)
  {
    DebugConsole_Printf("[RTC] Set DS3231 to build time: 20%02u-%02u-%02u %02u:%02u:%02u\r\n",
                        (unsigned int)year, (unsigned int)month, (unsigned int)day,
                        (unsigned int)hour, (unsigned int)min, (unsigned int)sec);
  }
  else
  {
    DebugConsole_Printf("[RTC] DS3231 set-time write failed (status=%d).\r\n", (int)status);
  }
}
#endif

/**
  * @brief Print the DS3231 time once during boot so we can confirm the module.
  *        If the year reads back as 2000 (power-on default / dead battery),
  *        report it and only seed it when the build-time toggle is enabled.
  */
static void DS3231_LogBootTime(void)
{
  char rtc_text[32] = {0};

#if DS3231_ENABLE_BUILD_TIME_SEED
  DebugConsole_Printf("[RTC] DS3231 build-time seed enabled; writing compile-time timestamp now.\r\n");
  DS3231_SetBuildTime();
#endif

  if (DS3231_ReadDateTimeWithRetry(rtc_text, sizeof(rtc_text)))
  {
    /* If the RTC still reports year 2000 after an update attempt, it likely
     * means the chip was not writable or the I2C transaction failed. */
    if (strncmp(rtc_text, "2000-", 5U) == 0)
    {
      DebugConsole_Printf("[RTC] DS3231 year=2000 (power-on default); build-time seed is disabled.\r\n");
    }

    (void) snprintf(g_ds3231_last_timestamp, sizeof(g_ds3231_last_timestamp),
                    "%s", rtc_text);
    g_ds3231_last_timestamp_valid = true;
    DebugConsole_Printf("[RTC] DS3231 time: %s\r\n", rtc_text);
  }
  else
  {
    DebugConsole_Printf("[RTC] DS3231 probe/read failed on I2C1.\r\n");
  }
}

/**
  * @brief Format the current DS3231 time for use in a capture filename.
  *
  * The RTC returns a human-readable timestamp with spaces and colons.
  * Those characters are sanitized here so the string is safe to use in a
  * filesystem path.
  */
bool App_Clock_GetCaptureTimestamp(char *buffer, uint32_t buffer_length)
{
  char rtc_text[32] = {0};
  uint32_t source_index = 0U;
  uint32_t dest_index = 0U;

  if ((buffer == NULL) || (buffer_length == 0U))
  {
    return false;
  }

  if (!DS3231_ReadDateTimeWithRetry(rtc_text, sizeof(rtc_text)))
  {
    if (!g_ds3231_last_timestamp_valid)
    {
      return false;
    }

    (void) snprintf(rtc_text, sizeof(rtc_text), "%s",
                    g_ds3231_last_timestamp);
  }

  (void) snprintf(g_ds3231_last_timestamp, sizeof(g_ds3231_last_timestamp),
                  "%s", rtc_text);
  g_ds3231_last_timestamp_valid = true;

  while ((rtc_text[source_index] != '\0')
         && ((dest_index + 1U) < buffer_length))
  {
    char ch = rtc_text[source_index++];

    if (ch == ' ')
    {
      ch = '_';
    }
    else if (ch == ':')
    {
      ch = '-';
    }

    buffer[dest_index++] = ch;
  }

  buffer[dest_index] = '\0';
  return (rtc_text[source_index] == '\0');
}
#endif /* DS3231 implementation moved to ds3231_clock.c */

